Triangulo_25_porciento/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1000;

vertices
(
    (-0.150 -0.150  -0.101)
    (0.150 -0.150  -0.101)
    (0.150  0.150  -0.101)
    (-0.150  0.150  -0.101)
    (-0.150 -0.150 0.101)
    (0.150 -0.150 0.101)
    (0.150  0.150 0.101)
    (-0.150  0.150 0.101)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) fluid (50 50 50) simpleGrading (1 1 1)
);

defaultPatch
{
    type patch;
}

boundary
(
);

// ************************************************************************* //
